import random

def getAotu():


    a1 = random.random()
    a2 = random.random()
    a3 = random.random()
    b1 = random.random()
    b2 = random.random()
    b3 = random.random()

    if a1 > 0.5:
        a1 = 1
    else :
        a1 = 0
    if a2 > 0.5:
        a2 = 1
    else:
        a2 = 0
    if a3 > 0.5:
        a3 = 1
    else:
        a3 = 0

    if b1 > 0.5:
        b1 = 1
    else:
        b1 = 0
    if b2 > 0.5:
        b2 = 1
    else:
        b2 = 0
    if b3 > 0.5:
        b3 = 1
    else:
        b3 = 0

    a = a1 * 4 + a2 * 2 + a3
    b = b1 * 4 + b2 * 2 + b3

    _temp = getDivination(a , b)
    return _temp

def getDvinationBase():
    base64gua = ['乾' , '坤' , '屯' , '蒙' , '需' , '讼' , '师' , '比' ,
                 '小畜' , '履' , '泰' , '否' , '同人' , '大有' , '谦' , '豫' ,
                 '随', '蛊', '临', '观', '噬嗑', '贲', '剥', '复',
                 '无妄', '大畜', '颐', '大过', '坎', '离', '咸', '恒',
                 '遯', '大壮', '晋', '明夷', '家人', '睽', '蹇', '解',
                 '损', '益', '夬', '姤', '萃', '升', '困', '井',
                 '革', '鼎', '震', '艮', '渐', '归妹', '丰', '旅',
                 '巽', '兑', '涣', '节', '中孚', '小过', '既济', '未济'
                 ]

    base64gua_gm = ['困龙得水', '饿虎得食', '乱丝无头', '小鬼偷钱', '明珠出土', '二人争路', '马到成功', '船得顺风', '密云不雨', '俊鸟出笼', '喜报三元', '虎落陷坑', '仙人指路', '砍树摸雀', '二人分金', '青龙得位', '推车靠岸', '推磨岔道', '发政施仁', '鹳鹊同林', '饥人遇食', '喜气迎门', '旱莲逢河', '夫妻反目', '鸟困牢笼', '阵势得开', '渭水访贤', '夜梦金银', '水底捞月', '天官赐福', '萌芽出土', '鱼来撞网', '浓云蔽日', '工师得木', '锄地得金', '过河拆桥', '镜里观花', '行走薄冰', '雨雪载途', '五关脱难', '推车掉耳', '枯木开花', '游蜂脱网', '他乡遇友', '鲤鱼化龙', '指日高升', '撮杆抽梯', '枯井生泉', '旱苗得雨', '渔人得利', '金钟夜撞', '矬巴勾枣', '凤鸣歧山', '缘木求鱼', '古镜重明', '宿鸟焚巢', '孤舟得水', '趁水和泥', '隔河望金', '斩将封神', '贩卖猪羊', '急过独桥', '金榜题名', '太岁月健']


    base64gua_qian = ['上上卦', '上中卦', '下下卦', '中下卦', '上上卦', '平平卦', '上平卦', '上吉卦', '下平卦', '中吉卦', '上吉卦', '下平卦', '中吉卦', '上中卦', '上平卦', '上中卦', '下吉卦', '中下卦', '上平卦', '下中卦', '中平卦', '中上卦', '上吉卦', '中下卦', '中下卦', '中吉卦', '上吉卦', '下下卦', '下下卦', '上上卦', '平平卦', '上平卦', '中平卦', '上平卦', '上平卦', '下平卦', '下下卦', '下平卦', '下下卦', '中吉卦', '下中卦', '中吉卦', '中吉卦', '上平卦', '中吉卦', '上吉卦', '下平卦', '上中卦', '上平卦', '上中卦', '中吉卦', '下中卦', '上上卦', '下平卦', '中吉卦', '下下卦', '中吉卦', '中吉卦', '下下卦', '上吉卦', '下下卦', '中平卦', '上中卦', '中平卦']


    base64gua_gc = ['困龙得水好运交，不由喜气上眉梢。一切谋望皆如意，向后时运渐渐高。', '饿虎得食喜气欢，求名应事主高迁。出门吉利行人到，是非口舌不相干。 ', '风刮乱丝不见头，颠三倒四犯忧愁。慢行缓来头有绪，急促反惹不自由。 ', '卦中气象犯小耗，谋望求财枉徒劳。婚姻合伙有人破，交易出行犯唠叨。 ', '明珠土埋日久深，无光无毫到如今。忽然大风吹去土，自然显露又重新。 ', '二人争路未肯降，占着此卦费主张。交易出行有阻隔，生意合伙有平常。 ', '将帅领旨去出征，骑着烈马拉硬弓。百步穿杨去的准，箭射金钱喜气生。 ', '顺风行船撒起棚，上天又助一篷风。不用费力逍遥去，任意而行大亨通。 ', '浓云密排下雨难，盼望行人不见还。交易出行空费力，婚姻求谋是枉然。 ', '俊鸟幸得出笼中，脱离灾难显威风。一朝得志凌云去，东南西北任意行。 ', '喜报三元运气强，谋望求财大吉祥。交易出行多得意，是非口舌总无妨。 ', '虎落陷坑不堪言，前进容易退后难。谋望不遂自己便，疾病口舌有牵连。 ', '仙人指路过路通，劝君任意走西东。交易求财不费力，生意合伙也相通。 ', '砍树摸雀做事牢，是非口舌自然消。婚姻合伙不费力，若问走失未脱逃。 ', '天赐贫人一封金，不用争来二人分。彼此分得金到手，一切谋望皆遂心。 ', '青龙得意喜气生，谋望求财事有成。婚姻出行无阻隔，是非口舌的安宁。 ', '推车靠堰道路干，谋望求财不费难。婚姻出行无阻隔，疾病口舌保平安。 ', '卦中象如推磨，顺当为福反为祸。心中有数事改变，凡事尽从忙里错。 ', '发政施仁志量高，出外求财任逍遥。交易婚姻大有意，走失行人有信耗。 ', '鹊遇天晚宿林中，不知林内先有鹳。虽然同处心生恶，卦外逢之事非轻。 ', '运拙如同身受饥，幸得送饭又遇食。适口充肠心欢喜，忧愁从此渐消移。 ', '时来运转锐气周，窈窕淑女君子求。钟古乐之大吉庆，占着此卦喜临头。 ', '花遇甘露旱逢河，生意买卖利息多。婚姻自有人来助，出门永不受折磨。 ', '若占此卦不相和，忧疑愁闲无定夺。恩人无义反成怨，是非平地起风波。 ', '鸟如笼中难出头，占着此卦不自由。谋望求财不定准，疾病忧犯口舌愁。 ', '忧愁常锁两眉间，千头万绪挂心间。从今以后打开阵，任意而行不相干。 ', '文王访贤在渭滨，谋望求财事遂心。交易出行方如意，疾病口舌可离身。 ', '夜梦金银醒来空，求名求利大不通。婚姻难成交易散，走失行人不见踪。 ', '一路明月照水中，只见影儿不见踪。愚人当财下去取，摸来摸去一场空。 ', '占此卦者遇天宫，富禄必然降人间。一切谋望皆吉庆，愁闲消散主平安。 ', '脚踏棒槌转悠悠，时运不来莫强求。幸喜今日时运转，自有好事在后头。 ', '鱼来撞网乐自然，卦占行人不久还。交易婚姻两成就，谋望求财不费难。 ', '浓云遮日不光明，劝君切莫远出行。婚姻求财皆不吉，须防口舌到门庭。 ', '卦占工师得大木，眼前该着走上路。时来运转多顺当，有事自管放心做。 ', '锄地锄去苗里草，谁想财帛将人找，谋望求财皆如意，这个运气也算好。 ', '时乖运拙走不着，急忙过河拆了桥。恩人无义反为怨，凡事无功枉受劳。 ', '镜里观花休认真，谋望求财不遂心。交易慢成婚姻散，走失行人无音信。 ', '路上行人色匆匆，过河无桥遇薄冰。小心谨慎过得去，一步错了落水中。 ', '大雨倾地雪满天，路上行人苦又难，拖泥带水费尽力，事不遂心且耐烦。 ', '五关脱难运抬头，劝君须当把财求。交易出行有人助，疾病口舌不用愁。 ', '时运不至费心多，比作推车受折磨。山路崎岖掉了耳，左插右安安不着。 ', '时来运转喜气发，多年枯木又开花。枝叶重生多茂盛，几人见了几人夸。 ', '游蜂脱网喜无边，添财进口福禄连。外则通达内则顺，富贵荣华胜以前。 ', '他乡遇友喜气欢，须知运气福重添。自今交了顺当运，向后保管不相干。 ', '鲤鱼化龙喜气来，口舌疾病永无灾。愁疑从此都消散，祸门闭来福门开。 ', '指日离升气象新，走失行人有音信。功名出行遂心好，疾病口舌皆除根。 ', '时运不来有人欺，千方百计费商议。明明与你说好话，撮上杆去抽了梯。 ', '枯井破了已多年，一朝涌泉出水新。资生济渴人称羡，时来运转乐自然。 ', '苗逢旱天渐渐衰，幸得天恩降雨来。忧去喜来能变化，求谋诸事遂心怀。 ', '若占此卦喜自然，求名求利两周全。婚姻合伙皆如意，生意兴隆乐自然。 ', '占者逢之撞金钟，时来运转响一声。谋事求财不费力，交易合伙大亨通。 ', '矬巴勾枣难捞枝，交易寻人不投机，谋望求财最费力，婚姻合伙终是虚。', '凤凰落在西岐山，长鸣几声出圣贤。天降文王开基业，富贵荣华八百年。 ', '求鱼须当向水中，树上求之不顺情。受尽爬揭难遂意，劳而无功事不成。 ', '古镜昏暗好几年，一朝磨明似月圆。君子谋事占此卦，时来运转乐自然。 ', '飞鸟树上筑高巢，小人使计用火烧。如占此卦大不利，一切谋望枉徒劳。 ', '泛舟得水离沙滩，出外行人早回家。是非口舌皆无碍，婚姻合伙更不差。 ', '这个卦象真有趣，觉着做事不费力。休要错过这机会，事事就觉遂心意。 ', '隔河望见一锭金，欲取河宽水又深。指望钱财难到手，日夜思想妄费心。 ', '时来运转喜气生，登台封神姜太公。到此诸神皆退位，纵然有祸不成凶。 ', '此卦占之运气歹，如同太公做买卖。贩猪羊快贩牛迟，猪羊齐贩断了宰。 ', '行人路过独木桥，心内惶恐眼里跳。爽利保保过得去，慢行一步不安牢。 ', '金榜之上提姓名，不负当年苦用功。人逢此卦多吉庆，一切谋望大亨通。 ', '太岁入运事多愁，婚姻财帛莫强求。交易出门走见吉，走失行人不露头。 ']


    base64gua_ys = ['飞龙在天，名利双收之象，宜把握机会，争取成果。 ', '诸事不宜急进，以静制动为宜。 ', '身处困境，步步为营，有初难后解之意。 ', '初时迷惑不知方向，须忍耐待机而动，凡事多听取别人意见，则运可通。 ', '智者必须待时而行，急进反见凶险。 ', '事与愿违，凡事不顺，小人加害，宜防陷阱。 ', '困难重重，凡事以正规行事，忌独断独行，投机取巧，提防潜在敌人。 ', '平顺可得贵人提拔，凡事宜速战速决，不可过份迟疑。 ', '运势反覆，有口舌之争，但难于短期内解决，须忍耐，静待时机。 ', '先劳而后逸，始惊而后安，百事不宜急进，须以和待人，有惊无险。 ', '诸事吉祥顺利，凡事宜内求，不宜外求，防乐极生悲。 ', '上下不和，百事不通，凡事宜忍，须知否极泰来。 ', '如意吉祥，与人共事，上下皆和，又得长辈提拔。 ', '得时得运，昌荣大吉，但防物极必反，盛极而衰。 ', '吉利平安。前途无限，但必须去除骄横之气。 ', '如意安泰，可得长辈扶助，但须防色难，凡事应有备而战。', '有去旧迎新之吉象，宜与人合作，可获厚利，忌三心两意，或独断独行。 ', '诸事不如意，艰难迷惑，宜大胆革新，否则引来内忧外患。', '诸事亨通，上下和合，前途有望，但不宜过于急进。 ', '处身于变化之中，宜多观察入微，心身苦恼，并防外来诱惑。 ', '诸事阻隔，纷争难免，宜守常规，不为利诱，问题可解决。', '表面风光内里空虚，必须充实自己，凡事踏实，按部就班。', '恶运缠身，宜重新部署，不宜自作聪明，防被女子及小人连累。 ', '开运亨通之象，万事不宜急进，按部就班可成。 ', '凡事宜守正，若行为不检者，必招灾祸。 ', '处事不可好高骛远，宜脚踏实地，可成大业，忌目空一切。 ', '处事欠缺周详考虑，不宜心怀阴谋，要守正道而善方吉。 ', '有力不从心，负担过重之象，多烦恼，防官非及水险。 ', '危机重重，宜沉著应付，保持心境开朗，凡事莫与人争。 ', '外观极盛，烈日当空之象，凡事不宜急进及意气用事。 ', '如意吉祥，但勿为不正当感情而意乱情迷。 ', '万事亨通，能恒久努力，安守本份则吉，妄动则招灾。 ', '小人道长，君子道消，凡事宜退不宜进，穷则独善其身，养诲修身。 ', '运势虽强，但已届极盛之时，宜心平气和，否则反招失败，须知物极必反。 ', '事业、名望、财运皆吉，所谓有加官晋爵之兆。 ', '百事阻滞，小人加害，遇事多迷惑，宜守，静待时机而动。', '平安大吉，与人合作则易成，更有喜庆之象，如添丁婚嫁等。 ', '气运欠佳，诸事难成，有水火不容之象，宜处变不惊。 ', '多灾多难，进退两难，此时宜守正道，不可轻举妄动，动反招祸。 ', '宜把握良机，快速处理，身边困境，更宜出外求谋，因贵人在远方，以西南为吉方。 ', '现况诸事不顺，有破财之象，虽先损失，但后反而得益，因祸得福。 ', '现正当吉运，可得贵人之助而成功，宜施惠于人，施比受更有福。 ', '目前虽吉，但困难及变动正在蕴酿中，宜提高警觉，忌骄傲，防口舌是非。 ', '阴长阳消，注意桃色纠纷，诸事阻滞，宜慎重行事。 ', '吉运昌盛，又得长辈提携，事业大利，但须防财务纠纷。 ', '名利双收，发展开运之象，宜向南方发展。 ', '诸事不如意，所谓龙游浅水遭虾戏。 ', '井为静物，不能移动，故凡事不能进取主动，又缺乏冲劲，不如处之泰然更有利。 ', '凡事均在变动之中，宜去旧立新，以应革新之象。 ', '时运仍佳，事业可成，但诸事不宜迟滞，及防有诉讼之累。', '表面昌盛风光，内里正处多事之秋，动荡不安之境。 ', '凡事不宜妄动，前路受阻，只好待机而动。 ', '逐渐走向光明前途，凡事宜打根基，可得吉庆，但须防色情之难及文书错失。 ', '处事有违常理正道，先得其益，但随后祸事百端。 ', '运势极强，为收获之时，但不宜贪得无厌，须知足常乐，要防是非，损财甚至火险。 ', '诸事变动不定，此时只好坚守信心，多参考他人意见，否则必有凶。 ', '波折重重，运势起落浮沉不定，要随机应变，心平气和，择善固执。 ', '悲喜交集，有誉有讥，守正道，诸事尚可称意。 ', '虽有忧患，但终可解困，百事亨通，忌任性散慢。 ', '有志不能伸，诸事必须节制，不宜过份，更要戒酒色。 ', '凡事以「诚」待人，以「信」处事则诸事皆吉，心存邪念则凶。 ', '诸事不利，宜行小事，不宜做大事，更防因小过失做成惊动，惹来是非争讼。 ', '名利双收，成功之象，防物极必反，初吉后凶。 ', '运气欠佳，但必须耐心突破难关，终可成功，有初凶后吉之象。 ']

    _dvinationList = []

    i = 0
    while i < 64:
        _dvination = []
        _dvination.append(i)
        _dvination.append(base64gua[i])
        _dvination.append(base64gua_gm[i])
        _dvination.append(base64gua_qian[i])
        _dvination.append(base64gua_gc[i])
        _dvination.append(base64gua_ys[i])

        _dvinationList.append(_dvination)
        i = i + 1

    return _dvinationList



def getDivination(a , b):
    _dvinationList = getDvinationBase()

    dvination  = 0
    # 0 000 坤
    # 1 001 艮
    # 2 010 坎
    # 3 011 巽
    # 4 100 震
    # 5 101 离
    # 6 110 兑
    # 7 111 乾

    if a == 0:
        if b == 0:
            dvination = 1
        elif b == 1:
            dvination = 22
        elif b == 2:
            dvination = 8
        elif b == 3:
            dvination = 19
        elif b == 4:
            dvination = 15
        elif b == 5:
            dvination = 34
        elif b == 6:
            dvination = 44
        elif b == 7:
            dvination = 12
    elif a == 1 :
        if b == 0:
            dvination = 14
        elif b == 1:
            dvination = 51
        elif b == 2:
            dvination = 38
        elif b == 3:
            dvination = 52
        elif b == 4:
            dvination = 61
        elif b == 5:
            dvination = 55
        elif b == 6:
            dvination = 30
        elif b == 7:
            dvination = 32
    elif a == 2 :
        if b == 0:
            dvination = 6
        elif b == 1:
            dvination = 3
        elif b == 2:
            dvination = 28
        elif b == 3:
            dvination = 58
        elif b == 4:
            dvination = 39
        elif b == 5:
            dvination = 63
        elif b == 6:
            dvination = 46
        elif b == 7:
            dvination = 5
    elif a == 3 :
        if b == 0:
            dvination = 45
        elif b == 1:
            dvination = 17
        elif b == 2:
            dvination = 47
        elif b == 3:
            dvination = 56
        elif b == 4:
            dvination = 31
        elif b == 5:
            dvination = 49
        elif b == 6:
            dvination = 27
        elif b == 7:
            dvination = 43
    elif a == 4 :
        if b == 0:
            dvination = 23
        elif b == 1:
            dvination = 26
        elif b == 2:
            dvination = 2
        elif b == 3:
            dvination = 41
        elif b == 4:
            dvination = 50
        elif b == 5:
            dvination = 20
        elif b == 6:
            dvination = 16
        elif b == 7:
            dvination = 24
    elif a == 5 :
        if b == 0:
            dvination = 35
        elif b == 1:
            dvination = 21
        elif b == 2:
            dvination = 62
        elif b == 3:
            dvination = 36
        elif b == 4:
            dvination = 54
        elif b == 5:
            dvination = 30
        elif b == 6:
            dvination = 48
        elif b == 7:
            dvination = 12
    elif a == 6 :
        if b == 0:
            dvination = 18
        elif b == 1:
            dvination = 40
        elif b == 2:
            dvination = 59
        elif b == 3:
            dvination = 60
        elif b == 4:
            dvination = 53
        elif b == 5:
            dvination = 37
        elif b == 6:
            dvination = 57
        elif b == 7:
            dvination = 9
    elif a == 7 :
        if b == 0:
            dvination = 10
        elif b == 1:
            dvination = 25
        elif b == 2:
            dvination = 4
        elif b == 3:
            dvination = 8
        elif b == 4:
            dvination = 33
        elif b == 5:
            dvination = 13
        elif b == 6:
            dvination = 42
        elif b == 7:
            dvination = 0

    return _dvinationList[dvination]


def fortune():
    finalgx = getAotu()
    return finalgx
